In [20]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P210201.csv')

In [5]:
df

,Unnamed: 0,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,502,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273,21.0,391.99,9.67,22.4
502,503,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273,21.0,396.90,9.08,20.6
503,504,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273,21.0,396.90,5.64,23.9
504,505,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273,21.0,393.45,6.48,22.0
505,506,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273,21.0,396.90,7.88,11.9

In [9]:
crim_sort = df['crim'].sort_values(ascending = False)

In [11]:
t10 = crim_sort

In [19]:
last = t10.head(10).iloc[9]

In [21]:
df['crim'] = np.where(df['crim'] >= last, last, df['crim'])

In [23]:
df['crim'].sort_values(ascending=False).head(10)

417    25.9406
380    25.9406
414    25.9406
413    25.9406
410    25.9406
405    25.9406
404    25.9406
427    25.9406
398    25.9406
418    25.9406
Name: crim, dtype: float64

In [24]:
age80 = df[df['age']>= 80]

In [27]:
print(round(age80['crim'].mean(), 2))

5.76

In [61]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P210202.csv')

In [62]:
len(df)

20640

In [63]:
train = df.iloc[:int(len(df)*0.8),:]

In [64]:
train

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
16507,-121.11,37.74,11.0,3886.0,599.0,1605.0,529.0,4.4213,182700.0,INLAND
16508,-121.10,37.80,35.0,1853.0,331.0,958.0,340.0,3.3578,149000.0,INLAND
16509,-121.11,37.76,22.0,2606.0,411.0,1252.0,397.0,4.1833,192100.0,INLAND
16510,-121.16,37.73,7.0,4956.0,941.0,3006.0,915.0,3.4426,139000.0,INLAND
16511,-121.25,37.76,22.0,2430.0,417.0,1292.0,391.0,3.4009,182400.0,INLAND

In [65]:
f = df['total_bedrooms'].std()

In [66]:
m = df['total_bedrooms'].median()

In [67]:
df['total_bedrooms'] = df['total_bedrooms'].fillna(m)

In [68]:
df['total_bedrooms'].isna().sum()

0

In [69]:
l = df['total_bedrooms'].std()

In [70]:
print(round(np.abs(f-l),2))

1.99

In [71]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P210203.csv')

In [76]:
df['charges'].std()

12110.011236694001

In [77]:
np.std(df['charges'])

12105.484975561612

In [79]:
mean = np.mean(df['charges'])
std = np.std(df['charges'])

In [80]:
up = mean + (1.5 * std)
low = mean - (1.5 * std)

In [88]:
a = list(df[df['charges'] >= up]['charges'])

In [90]:
b = list(df[df['charges'] <= low]['charges'])

In [91]:
c = a+b

In [96]:
int(sum(c))

6421430

In [103]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P210301.csv')

In [105]:
df = df.dropna()

In [110]:
train = df.iloc[:int(len(df)*0.7)]

In [121]:
print(int(np.quantile(df['housing_median_age'], q = 0.25)))

18

In [140]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P210302.csv')

In [141]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [142]:
a = df.isna().sum() / len(df)

In [143]:
a = a.sort_values(ascending=False)

In [147]:
print(a)

Age            0.198653
Embarked       0.002245
PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
dtype: float64

In [148]:
a = pd.DataFrame(a)

In [151]:
print(a.index[0])

Age

In [152]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P210303.csv')

In [156]:
df = df[['country', 'year', 'new_sp']]

In [157]:
df

          country  year  new_sp
0     Afghanistan  1980     NaN
1     Afghanistan  1981     NaN
2     Afghanistan  1982     NaN
3     Afghanistan  1983     NaN
4     Afghanistan  1984     NaN
...           ...   ...     ...
8702     Zimbabwe  2016     NaN
8703     Zimbabwe  2017     NaN
8704     Zimbabwe  2018     NaN
8705     Zimbabwe  2019     NaN
8706     Zimbabwe  2020     NaN

[8707 rows x 3 columns]

In [158]:
df = df.dropna()

In [159]:
df_2000 = df[df['year']==2000]

In [161]:
mean_sp = round(np.mean(df_2000['new_sp']), 2)

In [164]:
print(len(df_2000[df_2000['new_sp'] > mean_sp]))

38

In [165]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P220401.csv')

In [167]:
print(np.quantile(df['y'], q = 0.25), np.quantile(df['y'], q = 0.75))

40.25 77.0

In [168]:
print(np.quantile(df['y'], q = 0.75) - np.quantile(df['y'], q = 0.25))

36.75

In [169]:
print(int(np.quantile(df['y'], q = 0.75) - np.quantile(df['y'], q = 0.25)))

36

In [171]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P220402.csv')

In [173]:
df['positive_ratio'] = (df['num_loves'] + df['num_wows']) / df['num_reactions']

In [185]:
answer = df[(df['positive_ratio'] > 0.4) & (df['positive_ratio'] < 0.5)]

In [186]:
print(len(answer))

90

In [187]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P220403.csv')

In [197]:
df['date_added'] = pd.to_datetime(df['date_added'], format = '%B %d, %Y')

In [199]:
answer = df[(df['country'] == 'United Kingdom') & (df['date_added'].dt.year == 2018) & (df['date_added'].dt.month == 1)]

In [200]:
print(len(answer))

6

In [203]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P220501.csv', encoding='euc-kr')

In [204]:
df

,시도명,시군구명,종량제봉투종류,종량제봉투처리방식,종량제봉투용도,종량제봉투사용대상,1L가격,1.5L가격,2L가격,2.5L가격,...,60L가격,75L가격,100L가격,120L가격,125L가격,관리부서명,관리부서전화번호,데이터기준일자,제공기관코드,제공기관명
0,경기도,안양시,규격봉투,매립용,생활쓰레기,사업장용,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
1,경기도,안양시,규격봉투,매립용,생활쓰레기,기타,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
2,경기도,안양시,규격봉투,소각용,음식물쓰레기,가정용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
3,경기도,안양시,규격봉투,소각용,음식물쓰레기,사업장용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
4,경기도,안양시,규격봉투,소각용,음식물쓰레기,기타,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
741,충청남도,계룡시,재사용규격봉투,소각용,생활쓰레기,가정용,0,0,0,0,...,0,0,2320,0,0,환경위생과,042-840-2484,2019-05-16,5580000,충청남도 계룡시
742,충청남도,계룡시,재사용규격봉투,소각용,생활쓰레기,사업장용,0,0,0,0,...,0,0,2320,0,0,환경위생과,042-840-2484,2019-05-16,5580000,충청남도 계룡시
743,전라북도,김제시,규격봉투,소각용,생활쓰레기,가정용,0,0,0,0,...,0,0,0,0,0,환경과,063-540-3165,2018-08-09,4710000,전라북도 김제시
744,전라북도,김제시,특수규격마대,매립용,생활쓰레기,가정용,0,0,0,0,...,0,0,0,0,0,환경과,063-540-3165,2018-08-09,4710000,전라북도 김제시
745,전라북도,김제시,김장용봉투,소각용,음식물쓰레기,가정용,0,0,0,0,...,0,0,0,0,0,환경과,063-540-3165,2018-08-09,4710000,전라북도 김제시

In [206]:
answer = df[(df['종량제봉투종류'] == '규격봉투') & (df['종량제봉투용도'] == '음식물쓰레기') & (df['2L가격'] != 0)]

In [209]:
round(np.mean(answer['2L가격']), 0)

121.0

In [224]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P220502.csv')

In [225]:
df

     Gender  Height  Weight  Index
0      Male     174      96      4
1      Male     189      87      2
2    Female     185     110      4
3    Female     195     104      3
4      Male     149      61      3
..      ...     ...     ...    ...
495  Female     150     153      5
496  Female     184     121      4
497  Female     141     136      5
498    Male     150      95      5
499    Male     173     131      5

[500 rows x 4 columns]

In [231]:
df['BMI'] = (df['Weight'] / ((df['Height']/100) ** 2))

In [232]:
normal = df[(df['BMI'] >= 18.5) & (df['BMI'] < 23)]

In [233]:
danger = df[(df['BMI'] >= 23) & (df['BMI'] < 25)]

In [234]:
df

     Gender  Height  Weight  Index        BMI
0      Male     174      96      4  31.708284
1      Male     189      87      2  24.355421
2    Female     185     110      4  32.140248
3    Female     195     104      3  27.350427
4      Male     149      61      3  27.476240
..      ...     ...     ...    ...        ...
495  Female     150     153      5  68.000000
496  Female     184     121      4  35.739603
497  Female     141     136      5  68.407022
498    Male     150      95      5  42.222222
499    Male     173     131      5  43.770256

[500 rows x 5 columns]

In [235]:
print(round(np.abs(len(normal) - len(danger)), 0))

28

In [245]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P220503.csv', encoding='euc-kr')

In [246]:
df['순전입학생수'] = df['전입학생수(계)'] - df['전출학생수(계)']

In [250]:
df = df.sort_values(by = '순전입학생수', ascending = False)

In [260]:
print(df['전체학생수(계)'].iloc[0])

956

In [287]:
df = pd.read_csv('C:/Users/82108/Desktop/data/P230601.csv')

In [273]:
from datetime import datetime

In [274]:
df

                   신고일시              출동일시    출동소방서
0      2018-01-02 11:45  2018-01-02 11:50    양평소방서
1      2018-01-04 01:56  2018-01-04 02:00  수원남부소방서
2      2018-01-05 16:54  2018-01-05 16:54    김포소방서
3      2018-01-07 00:56  2018-01-07 01:01    포천소방서
4      2018-01-05 16:54  2018-01-05 16:55    고양소방서
...                 ...               ...      ...
21537  2018-12-16 12:00  2018-12-16 12:03  수원남부소방서
21538  2018-12-18 09:20  2018-12-18 09:22    안산소방서
21539  2018-12-14 13:03  2018-12-14 13:05    분당소방서
21540  2018-12-15 17:49  2018-12-15 17:56    김포소방서
21541  2018-12-15 21:54  2018-12-15 21:56    하남소방서

[21542 rows x 3 columns]

In [288]:
df['c_t'] = pd.to_datetime(df['신고일시'])
df['a_t'] = pd.to_datetime(df['출동일시'])

In [289]:
df['minus'] = (df['a_t'] - df['c_t']).dt.total_seconds()

In [290]:
df = df.groupby([df['출동소방서'], df['c_t'].dt.year, df['c_t'].dt.month]).mean('minus')

In [292]:
df = df.sort_values('minus', ascending = False)

In [296]:
df['minus'].iloc[0]

3840.0

In [297]:
num = float(df['minus'].iloc[0]) / 60

In [298]:
num

64.0

In [299]:
print(round(num))

64

In [301]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P230602.csv')

In [302]:
df

,school_name,student_1,student_2,student_3,student_4,student_5,student_6,teacher
0,서울교육대학교부설초등학교,95,95,95,104,108,110,31
1,서울대학교사범대학부설초등학교,97,100,102,102,102,104,36
2,서울개일초등학교,183,163,176,186,177,193,42
3,서울구룡초등학교,109,115,115,131,133,132,38
4,서울논현초등학교,34,47,34,46,46,46,18
...,...,...,...,...,...,...,...,...
6304,월랑초등학교,77,91,103,127,127,135,32
6305,이도초등학교,199,174,186,228,192,214,50
6306,도련초등학교,199,221,198,211,195,179,54
6307,삼화초등학교,111,104,124,136,141,128,34
6308,하귀일초등학교,100,99,103,119,94,97,30

In [308]:
df['ratio'] = (df['student_1'] + df['student_2'] + df['student_3'] + df['student_4'] + df['student_5'] + df['student_6']) / df['teacher']

In [309]:
df = df.sort_values(by = 'ratio', ascending = False)

In [311]:
print(int(df['teacher'].iloc[0]))

6

In [342]:
df = pd.read_csv('c:/Users/82108/Desktop/data/P230603.csv')

In [337]:
from datetime import datetime

In [343]:
df['year'] = df['년월'].str[:4]

In [344]:
df['s'] = df['강력범'] + df['절도범'] + df['폭력범'] + df['지능범'] + df['풍속범'] + df['기타형사범']

In [347]:
result = df.groupby('year').mean('s')

In [352]:
result

,강력범,절도범,폭력범,지능범,풍속범,기타형사범,s
year,,,,,,,
2013,523.000000,5132.083333,5451.833333,6378.416667,130.166667,1713.750000,19329.250000
2012,501.916667,5110.750000,5885.250000,6019.833333,161.833333,1612.083333,19291.666667
2011,575.416667,4524.500000,6003.666667,5937.666667,198.083333,1373.666667,18613.000000
2009,374.583333,3097.916667,6089.083333,6021.833333,516.916667,1405.333333,17505.666667
2010,552.333333,4115.166667,5733.166667,5530.666667,204.750000,1254.916667,17391.000000
2008,314.833333,2408.333333,6190.833333,5179.083333,248.333333,1290.416667,15631.833333
2007,281.916667,2498.083333,6168.333333,4545.916667,196.583333,1189.500000,14880.333333

In [348]:
result = result.sort_values(by = 's', ascending=False)

In [351]:
print(int(result['s'][0]))

19329